from flask.cli import with_appcontext
import click
from addiction.extensions import db
from addiction.models.staff import Staff
from addiction.models.user import User, UserRole, Role
from addiction.models.home import Home
from addiction.models.projects import Project
from flask import current_app
from addiction.models.file import File
import os

@click.command("init_db")
@with_appcontext
def init_db():
    click.echo("Creating Database")
    db.drop_all()
    db.create_all()
    click.echo("Finished Creating Database")


@click.command("populate_db")
@with_appcontext
def populate_db():
    click.echo("Creating staff")
    staff_members=[
        ("ჯანა ჯავახიშვილი", "darejan.javakhishvili@iliauni.edu.ge", "ილიაუნის ადიქტოლოგიის ინსტიტუტის დირექტორი და მკვლევარი, ფსიქოლოგიურ მეცნიერებათა დოქტორი, ილიაუნის მეცნიერებათა და ხელოვნების ფაკულტეტის პროფესორი; საქართველოს ადიქტოლოგთა ასოციაცის თანადამფუძნებელი და გამგეობის წევრი; ტრავმული სტრესის კვლევის საერთაშორისო საზოგადოების (ISTSS) დირექტორთა საბჭოს წევრი"),
        ("დავით ოთიაშვილი", 'davit.otiashvili@iliauni.edu.ge ', "ილიაუნის ადიქტოლოგიის ინსტიტუტის თანადამფუძნებელი და მკვლევარი, ჯანმრთელობის ფსიქოლოგიის დოქტორი, ილიაუნის სამედიცინო სკოლის ასოცირებული პროფესორი, საქართველოს ადიქტოლოგთა ასოციაციის თავმჯდომარე, საქართველოს ნარკომანიასთან ბრძოლის უწყებათაშორისი საბჭოს წევრი, სადაც წარმოადგენს არასამთავრობო სექტორს"),
        ("ირმა კირთაძე", 'irma.kirtadze@iliauni.edu.ge', "ილიაუნის ადიქტოლოგიის ინტიტუტის თანადამფუძმნებელი და მკვლევარი, საზოგადოებრივი ჯანმრთელობის დოქტორი, ილიაუნის მეცნიერებათა და ხელოვნების ფაკულტეტის ასოცირებული პროფესორი, საქართველოს ადიქტოლოგთა ასოციაციის თანადამფუძნებელი და გამგეობის წევრი "),
        ("მარიამ რაზმაძე", "mariam.razmadze.3@iliauni.edu.ge", "ილიაუნის ადიქტოლოგიის ინსტიტუტის კოორდინატორი და მკვლევარი, ფსიქიკური ჯანმრთელობის მაგისტრი, საქართველოს ადიქტოლოგთა ასოციაცის წევრი, ევროპის პრევენციის კურიკულუმის ეროვნული ტრენერი")
    ]

    for member in staff_members:
        new_member = Staff(name=member[0], email=member[1], position=member[2])
        
        new_member.create()



    click.echo("Creating users")
    admin_user=User(username="admin1", password='asdf')
    admin_user.create()

    roles=['user', 'moderator', 'admin']
    for role in roles:
        new_role=Role(name=role)
        new_role.create()
    
    admin_role=Role.query.filter_by(name="admin").first()
    admin_user_role=UserRole(user_id=admin_user.id, role_id=admin_role.id)
    admin_user_role.create()


    click.echo("Creating files")

    #for linux
    display_name=[
        "ყურადღების ცენტრში: ფენტანილები და სხვა ახალი ოპიოიდები",
        "ყურადღების ცენტრში: სინთეზური კანაბინოიდები" ,  
        "ყურადღების ცენტრში: ფსიქოაქტიური ნივთიერებების მოხმარება და ფსიქიკური ჯანმრთელობის კომორბიდული პრობლემები",
        "ხარისხის სტანდარტების დანერგვა ნარკოლოგიური სერვისებისა და სისტემებისთვის", 
        "ნარკოტიკების ავადმოხმარების პრევენცია", 
        "სამოქმედო ჩარჩო ნარკოტიკებთან დაკავშირებულ პრობლემებზე საპასუხო ჯანდაცვითი და სოციალური ზომების შემუშავებისა და განხორციელებისთვის",
        "მედია, ფსიქიკური ჯანმრთელობა და ადამიანის უფლებები", 
        "კანაფი: ჯანდაცვითი და სოციალური საპასუხო ზომები",
        "ოპიოიდები: ჯანდაცვითი და სოციალური საპასუხო ზომები",
        "ახალი ფსიქოაქტიური ნივთიერებები: ჯანდაცვითი და სოციალური საპასუხო ზომები", 
        "სტიმულატორები: ჯანდაცვითი და სოციალური საპასუხო ზომები",
        "ოპიოიდების მოხმარებასთან დაკავშირებული სიკვდილი: ჯანდაცვითი და სოციალური საპასუხო ზომები",
        "წამლების არასამედიცინო დანიშნულებით გამოყენება: ჯანდაცვითი და სოციალური საპასუხო ზომები",
        "ნარკოტიკების პოლიმოხმარება: ჯანდაცვითი და სოციალური საპასუხო ზომები",  
        "Piloting Comprehensive Social Influence (‘Unplugged’) Program in Georgia: A", 
        "‘Ten Years Later’ – Developing Institutional Mechanisms for Drug Demand Reduction and Addictology Education in Georgia – A Case Study ", 
        "ჩანაცვლებითი თერაპიის სერვისებით მოსარგებლეთა კმაყოფილების კვლევა დასავლეთ საქართველოში", 
        "პრევენციის ევროპული კურიკულუმი",

    ]

    #for windows
    # display_name=[ "‘Ten Years Later’ – Developing Institutional Mechanisms for Drug Demand Reduction and Addictology Education in Georgia – A Case Study ", 
    #                "Piloting Comprehensive Social Influence (‘Unplugged’) Program in Georgia: A", 
    #                "სამოქმედო ჩარჩო ნარკოტიკებთან დაკავშირებულ პრობლემებზე საპასუხო ჯანდაცვითი და სოციალური ზომების შემუშავებისა და განხორციელებისთვის",
    #                "ხარისხის სტანდარტების დანერგვა ნარკოლოგიური სერვისებისა და სისტემებისთვის", 
    #                 "მედია, ფსიქიკური ჯანმრთელობა და ადამიანის უფლებები", 
    #                 "ნარკოტიკების ავადმოხმარების პრევენცია", 
    #                  "პრევენციის ევროპული კურიკულუმი",
    #                 "ყურადღების ცენტრში: სინთეზური კანაბინოიდები" ,  
    #                 "ყურადღების ცენტრში: ფენტანილები და სხვა ახალი ოპიოიდები",
    #                 "ყურადღების ცენტრში: ფსიქოაქტიური ნივთიერებების მოხმარება და ფსიქიკური ჯანმრთელობის კომორბიდული პრობლემები",
    #                 "ჩანაცვლებითი თერაპიის სერვისებით მოსარგებლეთა კმაყოფილების კვლევა დასავლეთ საქართველოში", 
    #                 "კანაფი: ჯანდაცვითი და სოციალური საპასუხო ზომები",
    #                 "ახალი ფსიქოაქტიური ნივთიერებები: ჯანდაცვითი და სოციალური საპასუხო ზომები", 
    #                  "ნარკოტიკების პოლიმოხმარება: ჯანდაცვითი და სოციალური საპასუხო ზომები", 
    #                  "სტიმულატორები: ჯანდაცვითი და სოციალური საპასუხო ზომები",
    #                  "წამლების არასამედიცინო დანიშნულებით გამოყენება: ჯანდაცვითი და სოციალური საპასუხო ზომები", 
    #                  "ოპიოიდების მოხმარებასთან დაკავშირებული სიკვდილი: ჯანდაცვითი და სოციალური საპასუხო ზომები",
    #                  "ოპიოიდები: ჯანდაცვითი და სოციალური საპასუხო ზომები"
    #               ]
    relative='static/publications'
    incomplete_path=os.path.join(current_app.config['BASE_DIR'], relative)
    folder_names=os.listdir(incomplete_path)
    i=0
    for name in folder_names:
        complete_path=os.path.join(incomplete_path, name)
        files=os.listdir(complete_path)
        for filename in files:
            new_file=File(filename=filename, displayname=display_name[i], file_path=complete_path, category=name)
            i+=1
            new_file.create()

    
    click.echo("Creating home")
  

    about=["ილიას სახელმწიფო უნივერსიტეტის ტომაშ ზაბრანსკის სახელობის ადიქტოლოგიის ინსტიტუტი (შემოკლებით – ილიაუნის ადიქტოლოგიის ინსტიტუტი) ეწევა კვლევით, საგანმანათლებლო და საადვოკაციო საქმიანობას. ინსტიტუტი აკოორდინირებს ილიაუნის ადიქციის კვლევების სამაგისტრო პროგრამას.", 
    "ადიქცია (ანუ დამოკიდებულება) არის ბიო ფსიქო სოციალური პრობლემა. იგი საჭიროებს პრაგმატულ მიდგომასა და გეგმაზომიერ მართვას. პრობლემის საპასუხო ღონისძიებების სისტემა უნდა იყოს მულტიდისციპლინური (ბიოფსიქოსოციალური) და მტკიცებულებაზე დაფუძნებული.", 
    "ქვეყნის შესაძლებლობების გაზრდა ადიქციის პრობლემის მიმართ მტკიცებულებაზე დაფუძნებული მიდგომების დანერგვა-განვითარებაში.", 
    "დამოკიდებულების პრობლემის ეფექტური საპასუხო ღონისძიებათა სისტემის ამოქმედების ხელშეწყობა."]

    history= ["ევროკავშირისა და გაეროს განვითარების პროგრამის სამხრეთ კავკასიის ანტინარკოტიკული პროგრამის ფარგლებში მომზადდა ქართველი სპეციალისტების ჯგუფი, რომელთაც დაიწყეს მუშაობა ადიქციის პრობლემის საპასუხო ინსტიტუციური მექანიზმების შექმნაზე სხვადასხვა მიმართულებით: კვლევა, ნარკოვითარების მონიტორინგი და ნარკოეპიდემიოლოგია, ნარკოპოლიტიკა და ნარკოკანონმდებლობის რეფორმა, პრევენცია, მკურნალობა და ზიანის შემცირება. პარალელურად, შედგა თანამშრომლობა Johns Hopkins-ის უნივერსიტეტში პროფესიული დახელოვნებისთვის მივლენილ ქართველ და ჩეხ კოლეგებს შორის. ამ საექსპერტო თემმა დაიწყო ერთობლივი მუშაობა საქართველოში ადიქტოლოგიური განათლების ინსტიტუციური მექანიზმების განვითარებაზე. დასაწყისში ამ სამუშაოს მხარს უჭერდა ჩეხეთისა და ამერიკის განვითარების სააგენტოების პროექტები, ხოლო 2013 წლიდან ევროკომისიის TEMPUS-ის მექანიზმით დაფინანსებული პროექტი ADDIGE – Addictology Development in Georgia. 2013 წელს პროექტის ექსპერტთა ჯგუფმა მიმართა ილიას სახელმწიფო უნიევრსიტეტს ადიქციის კვლევების სამაგისტრო პროგრამის შექმნისა და ადიქტოლოგიის ინსტიტუტის დაფუძნების იდეით, რასაც ილიაუნიმ მზაობით, მხარდაჭერითა და ხელშეწყობით უპასუხა. ადიქციის კვლევების ინსტიტუტი მოქმედებს 2013 წლიდან, ადიქციის კვლევების სმაგისტრო პროგრამა დაფუძნდა ილიაუნიში 2015 წლიდან, ამჟამად ყავს უკვე 50-ზე მეტი კურსდამთავრებული, რომლებიც დასაქმებული არიან ნარკოვითარების მონიტორინგის, წამალდამოკიდებულების პრევენციის, მკურნალობის, ზიანის შემცირებისა და სხვა შესაბამის სფეროებში."]

    directions=["სანდო მონაცემების უზრუნველყოფა კვლევის, ნარკოვითარების მონიტორინგისა და შესაბამის უწყებებთან, ორგანიზაციებთან და ექსპერტებთან კოორდინაციის გზით;", 
                "კადრების მომზადება ადიქტოლოგიის სამაგისტრო პროგრამისა და ხანმოკლე პროფესიული კურსების ინსტიტუციური მექანიზმების განვითარების გზით;", 
                "ეროვნული და საერთაშორისო თანამშრომლობის ხელშეწყობა ადიქციის პრობლემის შესწავლაზე და საპასუხო მტკიცებულებითი ღონისძიებების სისტემის დანერგვაზე მიმართული პროექტების ინიციირებისა და განხორციელების გზით. "]
     
    n=0
    h=0
    for i in about:
        new_item=Home(about=i)
        if n<len(directions):
            new_item.directions=directions[n]
            n+=1
        else: 
            new_item.directions=None
        if h<len(history):
            new_item.history=history[h]
            h+=1
        else:
            new_item.history=None
        new_item.create()

    

    click.echo("Creating Projects")

    current=["2019 წლის აპრილიდან დღემდე (პროექტი გრძელდება 2023 წლის ივნისამდე) – პროექტი „Prevention of Addictions and Mental Disorders Among Adolescents in Georgia” (PAMAD), დონორი: ინგლისის სამედიცინო კვლევების საბჭო (Medical Research Council, UK; MR/S025278/1). პროექტის ფარგლებში ვთანამშრომლობთ ინგლისის მხრიდან – ლონდონის ტროპიკული მედიცინის სკოლასთან (London School of Tropical Medicine) და კარდიფის უნივერისტეტთან (Cardiff University); საქართველოს მხრიდან – ფონდთან „კურაციო“ და ფონდთან „გლობალური ინიციატივა ფსიქიატრიაში-თბილისი“. ფონდი „კურაციო“ არის პროექტის წამყვანი განმახორციელებელი ინსტიტუცია. კერძოდ, ფონდმა გლობალური ინიციატივა ფსიქიატრიაში-თბილისი 2019 წელს დააფუძნა ადიქციის მიზანმიმართული და შერჩევითი პრევენციის ოჯახზე დაფუძნებული სერვისი მოზარდებისთვის „კლუბი სინერგია“, და პროექტის ფარგლებში ამჟამად მიმდინარე კვლეა შეისწავლის სერვისის შედეგიანობას. კვლევის შედეგების საფუძველზე უკვე გამოქვეყნდა ერთი პუბლიკაცია ევროპის ფსიქოტრავმატოლოგიურ ჟურნალში, კიდე ორი პუბლიკაცია მომზადების პროცესშია.", 
             "2020 წლიდან დღემდე – ევროპის ტრავმული სტრესის კვლევის საზოგადოების ADJUST Study. ვახორციელებთ ერთროულად ევროპის 11 ქვეყანაში, ვიკვლევთ (ონალინ გამოკითხვის საშუალებით) კოვიდის პანდემიის გავლენას მოსახლეობის ფსიქიკურ ჯანმრთელობაზე. საქართველოს გუნდი მუშაობს მოხალისეობრივად, საქართველოში ჩატარებული კვლევის ფრაგმენტი ილიაუნის დოქტორანტის სადოქტორო დისერტაციის თემაა. მონაცემთა შესაგროვებელ პლატფორმასა და MAXQDA თვისებრივი ანალიზის პროგრამას აფინანსებს საქართველოს წამების მსხვერპლთა რეაბილიტაციის ცენტრი. პროექტის ფარგლებში გამოქვეყნდა უკვე ხუთი პუბლიკაცია საერთაშორისო რეფერირებად ჟურნალებში და იგეგმება შემდგომი პუბლიკაციები.", 
             "2021 წლის დეკემბრიდან დღემდე (პროექტი გრძელდება 2023 წლის მარტამდე) – პროექტი „ევროპის პრევენციის კურიკულუმის თარგმნა, ადაპტირება და ფორმატირება საქართველოში“, დამფინანსებელი – ევროპის ნარკოტიკებისა და წამალდამოკიდებულების მონიტორინგის ცენტრი (EMCDDA), განმახორციელებელი: ილიაუნის ადიქტოლოგიის ინსტიტუტი. პროექტის ფარგლებში ითარგმნა ევროპის პრევენციის კურიკულუმის სახელმძღვანელო, ჩატარდა მაფორმატირებელი კვლევა და ამ კვლევის საფუძველზე სახელმძღვანელო იქნა ადაპტირებული.", 
             "2022 წლის თებერვლიდან დღემდე (პროექტი გრძელდება 2023 წლის მარტამდე) – პროექტი „ადიქციების მკურნალობის მინი-გზამკვლევების თარგმნა, ადაპტირება და ფორმატირება საქართველოში“, დამფინანსებელი – ევროპის ნარკოტიკებისა და წამალდამოკიდებულების მონიტორინგის ცენტრი (EMCDDA), განმახორციელებელი: ილიაუნის ადიქტოლოგიის ინსტიტუტი. პროექტის ფარგლებში ითარგმნა ევროპის ნარკოტიკებისა და წამალდამოკიდებულების მონიტორინგის ცენტრის მიერ მომზადებული მკურნალობის 12 გზამკვლევი, ჩატარდა მაფორმატირებელი კვლევა და ამ კვლევის საფუძველზე ხორციელდება გზამკვლევების ადაპტაცია."]
    
    implemented=['''
    2013-2015 წლები – პროექტი „The development of human resources, evidence base and quality standards in addictology (trans-disciplinary addiction science) in Georgia“ (ADDIGE). დამფინანსებელი – ევროკომისია, TEMPUS-ის მექანიზმი. პროექტის მთავარი პარტნიორი – ჩარლზის უნივერსიტეტის პირველი სამედიცინო ფაკულტეტის ადიქტოლოგიის დეპარტამენტი. პროექტის ფარგლებში:

    ამოქმედდა და გაძლიერდა ადიქციის კვლევების სამაგისტრო პროგრამა; 
    შემუშავებულ და აკრედიტებულ იქნა 3-დღიანი პროფესიული დახელოვნების 5 კურსი: ექიმი-ნარკოლოგებისათვის, ექთნებისათვის, სოციალური მუშაკებისათვის, ფსიქოლოგებისათვის, ჟურნალისტებისათვის;
    ჩატარდა ადიქტოლოგიაში პროფესიული მომზადების 12 კურსი და 3 საზაფხულო სკოლა; ასევე, საზაფხულო სკოლა ახალგაზრდა მეცნიერთათვის ფსიქოტრავმატოლოგიაში ევროპის ტრავმული სტრესის კვლევის საზოგადოებასთან (ESTSS-თან) თანამშრომლობით;
    მომზადდა და გამოიცა საქართველოს ნარკოვითარების სამი ანალიტიკური ანგარიში (2013, 2014 და 2015 წლების);
    ჩატარდა საქართველოში მოქმედი ადიქტოლოგიური სტანდარტების კვლევა;
    განხორციელდა საერთაშორისო ადიქტოლოგიური სტანდარტების კვლევა; 
    ჩატარდა ახალგაზრდებში ჯანმრთელობასთან დაკავშირებული ქცევის პატერნების კვლევა იზრაელის ბენჰურიონის უნივერსიტეტთან ერთად.

    ''', 
    "2015-2017 წლები, პროექტი „ტოლერანტობის მარცვლები“. დამფინანსებელი – ევროკომისია (უკრაინა); პროექტის პარტნიორია ლონდონის ტროპიკული მედიცინის სკოლა. პროექტის ფარგლებში ჩატარდა უკრაინაში იძულებით გადაადგილებული პირების რეპრეზენტატიული შერჩევის ფსიქიკური ჯანმრთელობის პრობლემებისა და ალკოჰოლის მოხმარების კვლევა. კვლევის შედეგები ასახულია საერთაშორისო აკადემიურ ჟურნალებში დაბეჭდილ 5 სტატიაში. ", 
    "2016-2017 წლები – პროექტი: „იზრაელის ბენჰურიონის უნივერსიტეტსა და ილიას სახელმწიფო უნივერსიტეტში ჯანმრთელობის სარისკო ქცევებისა და ფსიქოაქტიური საშუალებების მოხმარების გავრცელების კვლევა“. პარტნიორი – იზრაელის ბენჰურიონის უნივერსიტეტი; პროექტი სამოხალისეოდ განხორციელდა. პროექტის ფარგლებში ჩატარდა რეოდენობრივი ონალინ გამოკითხვა ორივე უნივერსიტეტის სტუდენტებისა.", 
    "2017-2020 წლები – პროექტი „აივ-შიდსის პრევენცია ქუჩასთან დაკავშირებულ ბავშვებში“,  დაფინანსებულია შოთა რუსთაველის ეროვნული ფონდის საბაზო კვლევითი სახელმწიფო გრანტების კონკურსის ფარგლებში. პროექტი მიზნად ისახავდა ქუჩასთან დაკავშირებულ ბავშვებში აივ-ის გავრცელების თვალსაზრისით რისკისა და დამცავი ფაქტორების გამოვლენას. პროექტის ფარგლებში გამოიცა წიგნი „ქუჩასთან დაკავშირებული ახალგაზრდები: ეთიკური კვლევა და ანალიტიკა“, სტატიები გამოცემის პროცესშია.", 
    "2019 წლის აპრილი-დეკემბერი – პროექტი „ნარკომანიის პრევენციისა და ნარკოპოლიტიკის პოლიტიზება საქართველოში“, მხარდაჭერილი ილიაუნის ინსტიტუციური განვითარების საგრანტო კონკურსის ფარგლებში. პროექტის პარტნიორი/კონსულტანტი იყო სირაკუზის უნივერსიტეტის პროფესორი დესსა ბერგენ-სიკო. პროექტის ფარგლებში ჩატარდა საქართველოში განხორციელებული პრევენციული საინფორმაციო კამპანიების ნარატივებისა და დისკურსების თვისებრივი კვლევა.", 
    "2019 წელი – პროექტი „ოპიოიდებით ჩანაცვლებითი მკურნალობის ხელმისაწვდომობა საქართველოს პენიტენციურ სისტემაში: არსებული გამოწვევების და ბარიერების შესწავლა“, დაფინანსებელია ქართული არასამთავრობო ფონდის CTC-ი (Center for Training and Consultancy) მიერ, რომელიც თავად იყო ევროკავშირის დაფინანსებული პროექტის განმახორციელებლი და ამ პროექტის ფარგლებში ჩაატარა კვლევითი გრანტების კონკურსი, რომლის ფარგლებშიც გაიმარჯვა ილიაუნის ადიქტოლოგიის ინსტიტუტის განაცხადმა. პროექტის ფარგლებში ჩატარდა თვისებრივი კვლევა ყოფილ პატიმრებთან და ექსპერტთა ფოკუს ჯგუფები.", 
    "2020-2021 წლები – პროექტი „ოპიოიდებით ჩანაცვლებითი თერაპიის სერვისებით მოსარგებლეთა კმაყოფილების კვლევა დასავლეთ საქართველოში“, დამფინანსებელი ევრაზიის ზიანის შემცირების ასოციაცია (EAHRA), განმახორციელებელი ილიაუნის ადიქტოლოგიის ინსტიტუტი; წამყვანი განმახორციელებლი ინსტიტუცია – ფონდი „გლობალური ინიციატივა ფსიქიატრიაში – თბილისი“. პროექტის ფარგლებში ჩატარდა დასავლეთ საქართველოში ოპიოიდებით ჩანაცვლებითი თერაპიის სერვისებში ჩართულ მოსარგებლეთა წარმომადგენლობითი შერჩევის გამოკითხვა. კველვის ანგარიში გამოქვეყნდა ქართულ და ინგლისურ ენებზე; პუბლიკაცია საერთაშორისო სამეცნიერო ჟურნალისთვის მომზადების პროცესშია."
    ]
    n=0
    for i in implemented:
        new_project=Project(implemented=i)
        if n<len(current):
            new_project.current=current[n]
            n+=1
        else: 
            new_project.current=None
        new_project.create()


    



